

--用于用户自定义全局字符串

lua_str_WarnTips1 = "用户名长度为6-10位！"
lua_str_WarnTips2 = "用户密码长度为6-10位！"
lua_str_WarnTips3 = "当前选择的服务器维护中暂时无法进入!"
lua_str_WarnTips4 = "用户名已经被注册！"
lua_str_WarnTips5 = "注册密码不一致！"

lua_str_DialogTips1 = "与服务器断开连接，请检查您的网络环境，尝试重连？"
lua_str_DialogTips2 = "无法登录服务器，请检查网络是否正常!"

lua_Loading_Str1 = "资源加载中"

lua_Story_String1 = "    东汉末年，汉王朝政权由于不断更迭和动摇，导致朝纲紊乱，政治腐败，再加上天灾不断，导致社会上流民遍地，百姓怨声载道。公元184年（汉灵帝光和七年）冀州巨鹿人张角利用奇书《太平要术》笼络人心，趁机暴乱，高喊“苍天已死，黄天当立，岁在甲子，天下大吉”的口号。张角自称“天公将军”、张宝称“地公将军”、张梁称“人公将军”，率领三十六方渠帅数十万黄巾军四处攻城抢掠。"
lua_Story_String2 = "    汉灵帝以外戚何*进为大将军，统率左右羽林军屯兵洛阳，拱卫京师；命左中郎将皇甫蒿、右中郎将朱儁率步骑四万重点进攻颍川黄巾军；北中郎将卢植率北军讨伐河北黄巾军。同时，汉朝廷召集天下英豪共同围攻黄巾军。"
lua_Story_String3 = "%s已经完成！"

lua_SelCamp_String1 = "初始财政：资金%s锭  粮草%s石\n初始兵力：%d人\n初始将领：%s"
